Tomas-Kuchta-FPV/HacingTheSAMD20RadnoBoard/src/NRF905-Send/src/packs/ATSAMD20G18_DFP/component/pm.h
/* -------- PM_APBAMASK : (PM Offset: 0x18) (R/W 32) APBA Mask -------- */
#define PM_APBAMASK_RESETVALUE                _UINT32_(0x7F)                                       /*  (PM_APBAMASK) APBA Mask  Reset Value */

#define PM_APBAMASK_PAC0_Pos                  _UINT32_(0)                                          /* (PM_APBAMASK) PAC0 APB Clock Enable Position */
#define PM_APBAMASK_PAC0_Msk                  (_UINT32_(0x1) << PM_APBAMASK_PAC0_Pos)              /* (PM_APBAMASK) PAC0 APB Clock Enable Mask */
#define PM_APBAMASK_PAC0(value)               (PM_APBAMASK_PAC0_Msk & (_UINT32_(value) << PM_APBAMASK_PAC0_Pos)) /* Assigment of value for PAC0 in the PM_APBAMASK register */
#define PM_APBAMASK_PM_Pos                    _UINT32_(1)                                          /* (PM_APBAMASK) PM APB Clock Enable Position */
#define PM_APBAMASK_PM_Msk                    (_UINT32_(0x1) << PM_APBAMASK_PM_Pos)                /* (PM_APBAMASK) PM APB Clock Enable Mask */
#define PM_APBAMASK_PM(value)                 (PM_APBAMASK_PM_Msk & (_UINT32_(value) << PM_APBAMASK_PM_Pos)) /* Assigment of value for PM in the PM_APBAMASK register */
#define PM_APBAMASK_SYSCTRL_Pos               _UINT32_(2)                                          /* (PM_APBAMASK) SYSCTRL APB Clock Enable Position */
#define PM_APBAMASK_SYSCTRL_Msk               (_UINT32_(0x1) << PM_APBAMASK_SYSCTRL_Pos)           /* (PM_APBAMASK) SYSCTRL APB Clock Enable Mask */
#define PM_APBAMASK_SYSCTRL(value)            (PM_APBAMASK_SYSCTRL_Msk & (_UINT32_(value) << PM_APBAMASK_SYSCTRL_Pos)) /* Assigment of value for SYSCTRL in the PM_APBAMASK register */
#define PM_APBAMASK_GCLK_Pos                  _UINT32_(3)                                          /* (PM_APBAMASK) GCLK APB Clock Enable Position */
#define PM_APBAMASK_GCLK_Msk                  (_UINT32_(0x1) << PM_APBAMASK_GCLK_Pos)              /* (PM_APBAMASK) GCLK APB Clock Enable Mask */
#define PM_APBAMASK_GCLK(value)               (PM_APBAMASK_GCLK_Msk & (_UINT32_(value) << PM_APBAMASK_GCLK_Pos)) /* Assigment of value for GCLK in the PM_APBAMASK register */
#define PM_APBAMASK_WDT_Pos                   _UINT32_(4)                                          /* (PM_APBAMASK) WDT APB Clock Enable Position */
#define PM_APBAMASK_WDT_Msk                   (_UINT32_(0x1) << PM_APBAMASK_WDT_Pos)               /* (PM_APBAMASK) WDT APB Clock Enable Mask */
#define PM_APBAMASK_WDT(value)                (PM_APBAMASK_WDT_Msk & (_UINT32_(value) << PM_APBAMASK_WDT_Pos)) /* Assigment of value for WDT in the PM_APBAMASK register */
#define PM_APBAMASK_RTC_Pos                   _UINT32_(5)                                          /* (PM_APBAMASK) RTC APB Clock Enable Position */
#define PM_APBAMASK_RTC_Msk                   (_UINT32_(0x1) << PM_APBAMASK_RTC_Pos)               /* (PM_APBAMASK) RTC APB Clock Enable Mask */
#define PM_APBAMASK_RTC(value)                (PM_APBAMASK_RTC_Msk & (_UINT32_(value) << PM_APBAMASK_RTC_Pos)) /* Assigment of value for RTC in the PM_APBAMASK register */
#define PM_APBAMASK_EIC_Pos                   _UINT32_(6)                                          /* (PM_APBAMASK) EIC APB Clock Enable Position */
#define PM_APBAMASK_EIC_Msk                   (_UINT32_(0x1) << PM_APBAMASK_EIC_Pos)               /* (PM_APBAMASK) EIC APB Clock Enable Mask */
#define PM_APBAMASK_EIC(value)                (PM_APBAMASK_EIC_Msk & (_UINT32_(value) << PM_APBAMASK_EIC_Pos)) /* Assigment of value for EIC in the PM_APBAMASK register */
#define PM_APBAMASK_Msk                       _UINT32_(0x0000007F)                                 /* (PM_APBAMASK) Register Mask  */

#define PM_APBAMASK_PAC_Pos                   _UINT32_(0)                                          /* (PM_APBAMASK Position) PACx APB Clock Enable */
#define PM_APBAMASK_PAC_Msk                   (_UINT32_(0x1) << PM_APBAMASK_PAC_Pos)               /* (PM_APBAMASK Mask) PAC */
#define PM_APBAMASK_PAC(value)                (PM_APBAMASK_PAC_Msk & (_UINT32_(value) << PM_APBAMASK_PAC_Pos)) 

/* -------- PM_APBBMASK : (PM Offset: 0x1C) (R/W 32) APBB Mask -------- */
#define PM_APBBMASK_RESETVALUE                _UINT32_(0x1F)                                       /*  (PM_APBBMASK) APBB Mask  Reset Value */

#define PM_APBBMASK_PAC1_Pos                  _UINT32_(0)                                          /* (PM_APBBMASK) PAC1 APB Clock Enable Position */
#define PM_APBBMASK_PAC1_Msk                  (_UINT32_(0x1) << PM_APBBMASK_PAC1_Pos)              /* (PM_APBBMASK) PAC1 APB Clock Enable Mask */
#define PM_APBBMASK_PAC1(value)               (PM_APBBMASK_PAC1_Msk & (_UINT32_(value) << PM_APBBMASK_PAC1_Pos)) /* Assigment of value for PAC1 in the PM_APBBMASK register */
#define PM_APBBMASK_DSU_Pos                   _UINT32_(1)                                          /* (PM_APBBMASK) DSU APB Clock Enable Position */
#define PM_APBBMASK_DSU_Msk                   (_UINT32_(0x1) << PM_APBBMASK_DSU_Pos)               /* (PM_APBBMASK) DSU APB Clock Enable Mask */
#define PM_APBBMASK_DSU(value)                (PM_APBBMASK_DSU_Msk & (_UINT32_(value) << PM_APBBMASK_DSU_Pos)) /* Assigment of value for DSU in the PM_APBBMASK register */
#define PM_APBBMASK_NVMCTRL_Pos               _UINT32_(2)                                          /* (PM_APBBMASK) NVMCTRL APB Clock Enable Position */
#define PM_APBBMASK_NVMCTRL_Msk               (_UINT32_(0x1) << PM_APBBMASK_NVMCTRL_Pos)           /* (PM_APBBMASK) NVMCTRL APB Clock Enable Mask */
#define PM_APBBMASK_NVMCTRL(value)            (PM_APBBMASK_NVMCTRL_Msk & (_UINT32_(value) << PM_APBBMASK_NVMCTRL_Pos)) /* Assigment of value for NVMCTRL in the PM_APBBMASK register */
#define PM_APBBMASK_PORT_Pos                  _UINT32_(3)                                          /* (PM_APBBMASK) PORT APB Clock Enable Position */
#define PM_APBBMASK_PORT_Msk                  (_UINT32_(0x1) << PM_APBBMASK_PORT_Pos)              /* (PM_APBBMASK) PORT APB Clock Enable Mask */
#define PM_APBBMASK_PORT(value)               (PM_APBBMASK_PORT_Msk & (_UINT32_(value) << PM_APBBMASK_PORT_Pos)) /* Assigment of value for PORT in the PM_APBBMASK register */
#define PM_APBBMASK_Msk                       _UINT32_(0x0000000F)                                 /* (PM_APBBMASK) Register Mask  */

#define PM_APBBMASK_PAC_Pos                   _UINT32_(0)                                          /* (PM_APBBMASK Position) PACx APB Clock Enable */
#define PM_APBBMASK_PAC_Msk                   (_UINT32_(0x1) << PM_APBBMASK_PAC_Pos)               /* (PM_APBBMASK Mask) PAC */
#define PM_APBBMASK_PAC(value)                (PM_APBBMASK_PAC_Msk & (_UINT32_(value) << PM_APBBMASK_PAC_Pos)) 

/* -------- PM_APBCMASK : (PM Offset: 0x20) (R/W 32) APBC Mask -------- */
#define PM_APBCMASK_RESETVALUE                _UINT32_(0x10000)                                    /*  (PM_APBCMASK) APBC Mask  Reset Value */

#define PM_APBCMASK_PAC2_Pos                  _UINT32_(0)                                          /* (PM_APBCMASK) PAC2 APB Clock Enable Position */
#define PM_APBCMASK_PAC2_Msk                  (_UINT32_(0x1) << PM_APBCMASK_PAC2_Pos)              /* (PM_APBCMASK) PAC2 APB Clock Enable Mask */
#define PM_APBCMASK_PAC2(value)               (PM_APBCMASK_PAC2_Msk & (_UINT32_(value) << PM_APBCMASK_PAC2_Pos)) /* Assigment of value for PAC2 in the PM_APBCMASK register */
#define PM_APBCMASK_EVSYS_Pos                 _UINT32_(1)                                          /* (PM_APBCMASK) EVSYS APB Clock Enable Position */
#define PM_APBCMASK_EVSYS_Msk                 (_UINT32_(0x1) << PM_APBCMASK_EVSYS_Pos)             /* (PM_APBCMASK) EVSYS APB Clock Enable Mask */
#define PM_APBCMASK_EVSYS(value)              (PM_APBCMASK_EVSYS_Msk & (_UINT32_(value) << PM_APBCMASK_EVSYS_Pos)) /* Assigment of value for EVSYS in the PM_APBCMASK register */
#define PM_APBCMASK_SERCOM0_Pos               _UINT32_(2)                                          /* (PM_APBCMASK) SERCOM0 APB Clock Enable Position */
#define PM_APBCMASK_SERCOM0_Msk               (_UINT32_(0x1) << PM_APBCMASK_SERCOM0_Pos)           /* (PM_APBCMASK) SERCOM0 APB Clock Enable Mask */
#define PM_APBCMASK_SERCOM0(value)            (PM_APBCMASK_SERCOM0_Msk & (_UINT32_(value) << PM_APBCMASK_SERCOM0_Pos)) /* Assigment of value for SERCOM0 in the PM_APBCMASK register */
#define PM_APBCMASK_SERCOM1_Pos               _UINT32_(3)                                          /* (PM_APBCMASK) SERCOM1 APB Clock Enable Position */
#define PM_APBCMASK_SERCOM1_Msk               (_UINT32_(0x1) << PM_APBCMASK_SERCOM1_Pos)           /* (PM_APBCMASK) SERCOM1 APB Clock Enable Mask */
#define PM_APBCMASK_SERCOM1(value)            (PM_APBCMASK_SERCOM1_Msk & (_UINT32_(value) << PM_APBCMASK_SERCOM1_Pos)) /* Assigment of value for SERCOM1 in the PM_APBCMASK register */
#define PM_APBCMASK_SERCOM2_Pos               _UINT32_(4)                                          /* (PM_APBCMASK) SERCOM2 APB Clock Enable Position */
#define PM_APBCMASK_SERCOM2_Msk               (_UINT32_(0x1) << PM_APBCMASK_SERCOM2_Pos)           /* (PM_APBCMASK) SERCOM2 APB Clock Enable Mask */
#define PM_APBCMASK_SERCOM2(value)            (PM_APBCMASK_SERCOM2_Msk & (_UINT32_(value) << PM_APBCMASK_SERCOM2_Pos)) /* Assigment of value for SERCOM2 in the PM_APBCMASK register */
#define PM_APBCMASK_SERCOM3_Pos               _UINT32_(5)                                          /* (PM_APBCMASK) SERCOM3 APB Clock Enable Position */
#define PM_APBCMASK_SERCOM3_Msk               (_UINT32_(0x1) << PM_APBCMASK_SERCOM3_Pos)           /* (PM_APBCMASK) SERCOM3 APB Clock Enable Mask */
#define PM_APBCMASK_SERCOM3(value)            (PM_APBCMASK_SERCOM3_Msk & (_UINT32_(value) << PM_APBCMASK_SERCOM3_Pos)) /* Assigment of value for SERCOM3 in the PM_APBCMASK register */
#define PM_APBCMASK_SERCOM4_Pos               _UINT32_(6)                                          /* (PM_APBCMASK) SERCOM4 APB Clock Enable Position */
#define PM_APBCMASK_SERCOM4_Msk               (_UINT32_(0x1) << PM_APBCMASK_SERCOM4_Pos)           /* (PM_APBCMASK) SERCOM4 APB Clock Enable Mask */
#define PM_APBCMASK_SERCOM4(value)            (PM_APBCMASK_SERCOM4_Msk & (_UINT32_(value) << PM_APBCMASK_SERCOM4_Pos)) /* Assigment of value for SERCOM4 in the PM_APBCMASK register */
#define PM_APBCMASK_SERCOM5_Pos               _UINT32_(7)                                          /* (PM_APBCMASK) SERCOM5 APB Clock Enable Position */
#define PM_APBCMASK_SERCOM5_Msk               (_UINT32_(0x1) << PM_APBCMASK_SERCOM5_Pos)           /* (PM_APBCMASK) SERCOM5 APB Clock Enable Mask */
#define PM_APBCMASK_SERCOM5(value)            (PM_APBCMASK_SERCOM5_Msk & (_UINT32_(value) << PM_APBCMASK_SERCOM5_Pos)) /* Assigment of value for SERCOM5 in the PM_APBCMASK register */
#define PM_APBCMASK_TC0_Pos                   _UINT32_(8)                                          /* (PM_APBCMASK) TC0 APB Clock Enable Position */
#define PM_APBCMASK_TC0_Msk                   (_UINT32_(0x1) << PM_APBCMASK_TC0_Pos)               /* (PM_APBCMASK) TC0 APB Clock Enable Mask */
#define PM_APBCMASK_TC0(value)                (PM_APBCMASK_TC0_Msk & (_UINT32_(value) << PM_APBCMASK_TC0_Pos)) /* Assigment of value for TC0 in the PM_APBCMASK register */
#define PM_APBCMASK_TC1_Pos                   _UINT32_(9)                                          /* (PM_APBCMASK) TC1 APB Clock Enable Position */
#define PM_APBCMASK_TC1_Msk                   (_UINT32_(0x1) << PM_APBCMASK_TC1_Pos)               /* (PM_APBCMASK) TC1 APB Clock Enable Mask */
#define PM_APBCMASK_TC1(value)                (PM_APBCMASK_TC1_Msk & (_UINT32_(value) << PM_APBCMASK_TC1_Pos)) /* Assigment of value for TC1 in the PM_APBCMASK register */
#define PM_APBCMASK_TC2_Pos                   _UINT32_(10)                                         /* (PM_APBCMASK) TC2 APB Clock Enable Position */
#define PM_APBCMASK_TC2_Msk                   (_UINT32_(0x1) << PM_APBCMASK_TC2_Pos)               /* (PM_APBCMASK) TC2 APB Clock Enable Mask */
#define PM_APBCMASK_TC2(value)                (PM_APBCMASK_TC2_Msk & (_UINT32_(value) << PM_APBCMASK_TC2_Pos)) /* Assigment of value for TC2 in the PM_APBCMASK register */
#define PM_APBCMASK_TC3_Pos                   _UINT32_(11)                                         /* (PM_APBCMASK) TC3 APB Clock Enable Position */
#define PM_APBCMASK_TC3_Msk                   (_UINT32_(0x1) << PM_APBCMASK_TC3_Pos)               /* (PM_APBCMASK) TC3 APB Clock Enable Mask */
#define PM_APBCMASK_TC3(value)                (PM_APBCMASK_TC3_Msk & (_UINT32_(value) << PM_APBCMASK_TC3_Pos)) /* Assigment of value for TC3 in the PM_APBCMASK register */
#define PM_APBCMASK_TC4_Pos                   _UINT32_(12)                                         /* (PM_APBCMASK) TC4 APB Clock Enable Position */
#define PM_APBCMASK_TC4_Msk                   (_UINT32_(0x1) << PM_APBCMASK_TC4_Pos)               /* (PM_APBCMASK) TC4 APB Clock Enable Mask */
#define PM_APBCMASK_TC4(value)                (PM_APBCMASK_TC4_Msk & (_UINT32_(value) << PM_APBCMASK_TC4_Pos)) /* Assigment of value for TC4 in the PM_APBCMASK register */
#define PM_APBCMASK_TC5_Pos                   _UINT32_(13)                                         /* (PM_APBCMASK) TC5 APB Clock Enable Position */
#define PM_APBCMASK_TC5_Msk                   (_UINT32_(0x1) << PM_APBCMASK_TC5_Pos)               /* (PM_APBCMASK) TC5 APB Clock Enable Mask */
#define PM_APBCMASK_TC5(value)                (PM_APBCMASK_TC5_Msk & (_UINT32_(value) << PM_APBCMASK_TC5_Pos)) /* Assigment of value for TC5 in the PM_APBCMASK register */
#define PM_APBCMASK_TC6_Pos                   _UINT32_(14)                                         /* (PM_APBCMASK) TC6 APB Clock Enable Position */
#define PM_APBCMASK_TC6_Msk                   (_UINT32_(0x1) << PM_APBCMASK_TC6_Pos)               /* (PM_APBCMASK) TC6 APB Clock Enable Mask */
#define PM_APBCMASK_TC6(value)                (PM_APBCMASK_TC6_Msk & (_UINT32_(value) << PM_APBCMASK_TC6_Pos)) /* Assigment of value for TC6 in the PM_APBCMASK register */
#define PM_APBCMASK_TC7_Pos                   _UINT32_(15)                                         /* (PM_APBCMASK) TC7 APB Clock Enable Position */
#define PM_APBCMASK_TC7_Msk                   (_UINT32_(0x1) << PM_APBCMASK_TC7_Pos)               /* (PM_APBCMASK) TC7 APB Clock Enable Mask */
#define PM_APBCMASK_TC7(value)                (PM_APBCMASK_TC7_Msk & (_UINT32_(value) << PM_APBCMASK_TC7_Pos)) /* Assigment of value for TC7 in the PM_APBCMASK register */
#define PM_APBCMASK_ADC_Pos                   _UINT32_(16)                                         /* (PM_APBCMASK) ADC APB Clock Enable Position */
#define PM_APBCMASK_ADC_Msk                   (_UINT32_(0x1) << PM_APBCMASK_ADC_Pos)               /* (PM_APBCMASK) ADC APB Clock Enable Mask */
#define PM_APBCMASK_ADC(value)                (PM_APBCMASK_ADC_Msk & (_UINT32_(value) << PM_APBCMASK_ADC_Pos)) /* Assigment of value for ADC in the PM_APBCMASK register */
#define PM_APBCMASK_AC_Pos                    _UINT32_(17)                                         /* (PM_APBCMASK) AC APB Clock Enable Position */
#define PM_APBCMASK_AC_Msk                    (_UINT32_(0x1) << PM_APBCMASK_AC_Pos)                /* (PM_APBCMASK) AC APB Clock Enable Mask */
#define PM_APBCMASK_AC(value)                 (PM_APBCMASK_AC_Msk & (_UINT32_(value) << PM_APBCMASK_AC_Pos)) /* Assigment of value for AC in the PM_APBCMASK register */
#define PM_APBCMASK_DAC_Pos                   _UINT32_(18)                                         /* (PM_APBCMASK) DAC APB Clock Enable Position */
#define PM_APBCMASK_DAC_Msk                   (_UINT32_(0x1) << PM_APBCMASK_DAC_Pos)               /* (PM_APBCMASK) DAC APB Clock Enable Mask */
#define PM_APBCMASK_DAC(value)                (PM_APBCMASK_DAC_Msk & (_UINT32_(value) << PM_APBCMASK_DAC_Pos)) /* Assigment of value for DAC in the PM_APBCMASK register */
#define PM_APBCMASK_PTC_Pos                   _UINT32_(19)                                         /* (PM_APBCMASK) PTC APB Clock Enable Position */
#define PM_APBCMASK_PTC_Msk                   (_UINT32_(0x1) << PM_APBCMASK_PTC_Pos)               /* (PM_APBCMASK) PTC APB Clock Enable Mask */
#define PM_APBCMASK_PTC(value)                (PM_APBCMASK_PTC_Msk & (_UINT32_(value) << PM_APBCMASK_PTC_Pos)) /* Assigment of value for PTC in the PM_APBCMASK register */
#define PM_APBCMASK_Msk                       _UINT32_(0x000FFFFF)                                 /* (PM_APBCMASK) Register Mask  */

#define PM_APBCMASK_PAC_Pos                   _UINT32_(0)                                          /* (PM_APBCMASK Position) PAC2 APB Clock Enable */
#define PM_APBCMASK_PAC_Msk                   (_UINT32_(0x1) << PM_APBCMASK_PAC_Pos)               /* (PM_APBCMASK Mask) PAC */
#define PM_APBCMASK_PAC(value)                (PM_APBCMASK_PAC_Msk & (_UINT32_(value) << PM_APBCMASK_PAC_Pos)) 
#define PM_APBCMASK_SERCOM_Pos                _UINT32_(2)                                          /* (PM_APBCMASK Position) SERCOMx APB Clock Enable */
#define PM_APBCMASK_SERCOM_Msk                (_UINT32_(0x3F) << PM_APBCMASK_SERCOM_Pos)           /* (PM_APBCMASK Mask) SERCOM */
#define PM_APBCMASK_SERCOM(value)             (PM_APBCMASK_SERCOM_Msk & (_UINT32_(value) << PM_APBCMASK_SERCOM_Pos)) 
#define PM_APBCMASK_TC_Pos                    _UINT32_(8)                                          /* (PM_APBCMASK Position) TCx APB Clock Enable */
#define PM_APBCMASK_TC_Msk                    (_UINT32_(0xFF) << PM_APBCMASK_TC_Pos)               /* (PM_APBCMASK Mask) TC */
#define PM_APBCMASK_TC(value)                 (PM_APBCMASK_TC_Msk & (_UINT32_(value) << PM_APBCMASK_TC_Pos)) 

/* -------- PM_INTENCLR : (PM Offset: 0x34) (R/W 8) Interrupt Enable Clear -------- */
#define PM_INTENCLR_RESETVALUE                _UINT8_(0x00)                                        /*  (PM_INTENCLR) Interrupt Enable Clear  Reset Value */

#define PM_INTENCLR_CKRDY_Pos                 _UINT8_(0)                                           /* (PM_INTENCLR) Clock Ready Interrupt Enable Position */
#define PM_INTENCLR_CKRDY_Msk                 (_UINT8_(0x1) << PM_INTENCLR_CKRDY_Pos)              /* (PM_INTENCLR) Clock Ready Interrupt Enable Mask */
#define PM_INTENCLR_CKRDY(value)              (PM_INTENCLR_CKRDY_Msk & (_UINT8_(value) << PM_INTENCLR_CKRDY_Pos)) /* Assigment of value for CKRDY in the PM_INTENCLR register */
#define PM_INTENCLR_Msk                       _UINT8_(0x01)                                        /* (PM_INTENCLR) Register Mask  */


/* -------- PM_INTENSET : (PM Offset: 0x35) (R/W 8) Interrupt Enable Set -------- */
#define PM_INTENSET_RESETVALUE                _UINT8_(0x00)                                        /*  (PM_INTENSET) Interrupt Enable Set  Reset Value */

